@echo off

rem ::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::
rem :: 機能名　　　：　YouTubeチャット起動
rem :: 概要概要　　：　YouTubeチャット画面をEdgeで起動する。
rem :: 入力
rem :: 　引数１　　：　(なし)
rem :: 出力
rem :: 　戻り値　　：　0(正常終了)、1(異常終了)
rem :: 備考　　　　：　実行前にYouTubeライブのURLをコピーすること。
rem ::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::

rem ::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::
rem :: 変数設定（ユーザ設定項目）
rem :: ★バッチを使用する前にユーザが設定すること★
rem ::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::

rem 変数名：一時ファイル
set TEMP_FILE=..\output\temp.txt

echo ■設定値（ユーザ設定項目）■
echo   TEMP_FILE = %TEMP_FILE%
echo;

rem ::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::
rem :: 変数設定（バッチ設定項目）
rem ::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::

rem 変数名：終了ステータス
set RT_OK=0
set RT_NG=1

rem ::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::
rem :: 処理開始
rem ::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::

echo ■処理開始■

echo ①YouTubeチャット起動

powershell -command "Get-Clipboard" > %TEMP_FILE%
for /f "delims=" %%I in (%TEMP_FILE%) do (
    set URL=%%I
)
if not "%URL%" == "%URL:https://www.youtube.com/=%" (
    START microsoft-edge:"%URL:watch=live_chat%"
)

echo ②正常終了
exit /b %RT_OK%

:END_NG
echo ②異常終了
exit /b %RT_NG%
